{
    "provider": "aws",
    "service": "secretsmanager",
    "checks": [
        {
            "name": "secret_rotation_enabled",
            "title": "Ensure Secrets Manager Secrets Have Automatic Rotation Enabled",
            "result_kinds": [
                "aws_secretsmanager_secret"
            ],
            "categories": [
                "compliance"
            ],
            "risk": "Not enabling automatic rotation for Secrets Manager secrets may lead to extended periods of active secrets and increased business impact if compromised.",
            "severity": "medium",
            "detect": {
                "fix": "is(aws_secretsmanager_secret) and rotation_enabled==false"
            },
            "remediation": {
                "text": "To fix this issue, enable automatic rotation for the secret.",
                "url": "https://docs.aws.amazon.com/secretsmanager/latest/userguide/rotating-secrets.html",
                "complexity": "low"
            },
            "url": "https://docs.aws.amazon.com/secretsmanager/latest/userguide/rotating-secrets.html",
            "localizations": {
                "de": {
                    "title": "Stellen Sie sicher, dass Secrets Manager-Geheimnisse automatisch rotiert werden",
                    "risk": "Das Nichtaktivieren der automatischen Rotation für Secrets Manager-Geheimnisse kann zu längeren Zeiträumen aktiver Geheimnisse führen und die geschäftlichen Auswirkungen bei Kompromittierung erhöhen.",
                    "remediation": "Um dieses Problem zu beheben, aktivieren Sie die automatische Rotation für das Geheimnis."
                }
            }
        },
        {
            "name": "secret_not_used_90d",
            "title": "Ensure No Unused Secrets in the Last 90 Days",
            "result_kinds": [
                "aws_secretsmanager_secret"
            ],
            "categories": [
                "compliance"
            ],
            "risk": "If not solved, there is a risk of potential unauthorized access, lack of tracking or auditing, non-compliance with data retention policies, and increased exposure time for potential breaches.",
            "severity": "medium",
            "detect": {
                "fix": "is(aws_secretsmanager_secret) and last_accessed_date < {{secret_too_old_age.ago}}"
            },
            "default_values": {
                "secret_too_old_age": "90d"
            },
            "remediation": {
                "text": "To fix the issue, retrieve the details of a secret and view the LastAccessedDate to identify unused secrets.",
                "url": "https://docs.aws.amazon.com/secretsmanager/latest/userguide/rotating-secrets.html",
                "complexity": "low"
            },
            "url": "https://docs.aws.amazon.com/secretsmanager/latest/userguide/rotating-secrets.html",
            "localizations": {
                "de": {
                    "title": "Stellen Sie sicher, dass in den letzten 90 Tagen keine ungenutzten Secrets vorhanden sind",
                    "risk": "Wenn nicht behoben, besteht die Gefahr eines potenziellen unbefugten Zugriffs, fehlender Verfolgung oder Auditierung, Nichtkonformität mit Datenaufbewahrungsrichtlinien und verlängerter Expositionsdauer für potenzielle Sicherheitsverletzungen.",
                    "remediation": "Um das Problem zu beheben, rufen Sie die Details eines Secrets ab und überprüfen Sie das LastAccessedDate, um ungenutzte Secrets zu identifizieren."
                }
            }
        },
        {
            "name": "secret_not_changed_90d",
            "title": "Ensure Secrets Are Rotated Every 90 Days",
            "result_kinds": [
                "aws_secretsmanager_secret"
            ],
            "categories": [
                "compliance"
            ],
            "risk": "If secrets are not changed in the last 90 days, it indicates that they are no longer in use and can be removed.",
            "severity": "medium",
            "detect": {
                "fix": "is(aws_secretsmanager_secret) and last_changed_date<{{secret_too_old_age.ago}}"
            },
            "default_values": {
                "secret_too_old_age": "90d"
            },
            "remediation": {
                "text": "Set up automated or manual remediation to rotate old/expired credentials.",
                "url": "https://docs.aws.amazon.com/secretsmanager/latest/userguide/rotating-secrets.html",
                "complexity": "low"
            },
            "url": "https://docs.aws.amazon.com/secretsmanager/latest/userguide/rotating-secrets.html",
            "localizations": {
                "de": {
                    "title": "Stellen Sie sicher, dass Geheimnisse alle 90 Tage geändert werden",
                    "risk": "Wenn Geheimnisse in den letzten 90 Tagen nicht geändert wurden, deutet dies darauf hin, dass sie nicht mehr verwendet werden und entfernt werden können.",
                    "remediation": "Richten Sie automatisierte oder manuelle Maßnahmen ein, um alte/abgelaufene Berechtigungen zu ändern."
                }
            }
        },
        {
            "name": "secret_rotated_as_scheduled",
            "title": "Ensure Secrets Rotation Is Error-Free and Timely",
            "result_kinds": [
                "aws_account"
            ],
            "categories": [
                "security",
                "compliance"
            ],
            "risk": "Failure to solve this issue may result in errors or issues with secrets rotation, compromising the security and compliance of the AWS cloud infrastructure.",
            "severity": "medium",
            "detect": {
                "manual": "To verify if secrets are being rotated manually, use the AWS Secrets CLI to describe Secrets and check the LastRotatedDate for any issues with manual/automatic rotation."
            },
            "remediation": {
                "text": "Retrieve the details of a secret using the DescribeSecret API call to view the LastRotatedDate and assess if any corrective action is required.",
                "url": "https://docs.aws.amazon.com/secretsmanager/latest/apireference/API_DescribeSecret.html",
                "complexity": "medium"
            },
            "url": "https://docs.aws.amazon.com/secretsmanager/latest/apireference/API_DescribeSecret.html",
            "localizations": {
                "de": {
                    "title": "Stellen Sie sicher, dass die regelmäßige Rotation von Geheimnissen fehlerfrei und rechtzeitig erfolgt",
                    "risk": "Das Nichtbeheben dieses Problems kann zu Fehlern oder Problemen bei der Rotation von Geheimnissen führen und die Sicherheit und Compliance der AWS-Cloudinfrastruktur gefährden.",
                    "remediation": "Rufen Sie die Details eines Geheimnisses über den API-Aufruf DescribeSecret ab, um das LastRotatedDate anzuzeigen und zu prüfen, ob Maßnahmen erforderlich sind."
                }
            }
        }
    ]
}
