{
    "provider": "aws",
    "service": "glacier",
    "checks": [
        {
            "name": "vaults_policy_public_access",
            "title": "Ensure S3 Glacier Vaults Have Policies That Restrict Access to Authorized Users",
            "result_kinds": [
                "aws_glacier_vault"
            ],
            "categories": [
                "security"
            ],
            "risk": "If the issue is not resolved, S3 Glacier vaults accessible to everyone could lead to unauthorized access and exposure of sensitive data to potential malicious attackers.",
            "severity": "critical",
            "detect": {
                "fix": "is(aws_glacier_vault) and glacier_access_policy.Statement[*].{Effect==Allow and (Principal==\"*\" or Principal.AWS=\"*\" or Principal.CanonicalUser=\"*\")}"
            },
            "remediation": {
                "text": "To rectify the problem, ensure that the vault policy does not grant access to unauthorized users. Follow the guidelines provided in the AWS documentation to set up proper access controls for S3 Glacier vaults.",
                "url": "https://docs.aws.amazon.com/amazonglacier/latest/dev/access-control-overview.html",
                "complexity": "medium"
            },
            "url": "https://docs.aws.amazon.com/AmazonS3/latest/dev/amazon-s3-glacier.html",
            "localizations": {
                "de": {
                    "title": "Sorgen Sie dafür, dass S3 Glacier-Tresore Richtlinien haben, die den Zugriff auf autorisierte Benutzer beschränken.",
                    "risk": "Wenn das Problem nicht behoben wird, können S3 Glacier-Tresore, die für jeden zugänglich sind, zu unbefugtem Zugriff und Offenlegung sensibler Daten für potenziell bösartige Angreifer führen.",
                    "remediation": "Um das Problem zu beheben, stellen Sie sicher, dass die Tresor-Richtlinie keinen Zugriff für nicht autorisierte Benutzer gewährt. Befolgen Sie die Richtlinien in der AWS-Dokumentation, um angemessene Zugriffskontrollen für S3 Glacier-Tresore einzurichten."
                }
            }
        }
    ]
}
