{
    "provider": "aws",
    "service": "ssm",
    "checks": [
        {
            "name": "managed_instance_compliance_patch_compliant",
            "title": "Ensure that EC2 instances are covered under SSM patch manager",
            "result_kinds": ["aws_ec2_instance"],
            "categories": ["security", "compliance"],
            "risk": "AWS regularly releases new patched and updated AMI's, ensuring that EC2 are configured with patch manager enables EC2 instances to regularly get automated security patches",
            "severity": "medium",
            "detect": {
                "manual": "Go to AWS System manager -> Patch manager"
            },
            "remediation": {
                "text": "Ensure that all EC2 instances are covered under a patch policy",
                "url": "https://docs.aws.amazon.com/systems-manager/latest/userguide/patch-manager-create-a-patch-policy.html"
            },
            "source": "saad"
        },
        {
            "name": "no_secrets_in_content",
            "title": "Ensure that there are no secrets in SSM documents.",
            "result_kinds": ["aws_ssm_document"],
            "categories": ["security", "compliance"],
            "risk": "Secrets hardcoded into SSM Documents by malware and bad actors to gain lateral access to other services.",
            "severity": "medium",
            "detect": {
                "resoto_cmd": "search is(aws_ssm_document) and content!=null | detect-secrets --path content --with-secrets"
            },
            "remediation": {
                "text": "Use Secrets Manager service to store and retrieve passwords and secrets.",
                "url": "https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-properties-secretsmanager-secret-generatesecretstring.html"
            }
        },
        {
            "name": "document_is_shared",
            "title": "Ensure that there are no documents shared with any other account.",
            "result_kinds": ["aws_ssm_document"],
            "categories": ["security", "compliance"],
            "risk": "SSM Documents may contain private information or even secrets and tokens and should not be shared with other accounts.",
            "severity": "high",
            "detect": {
                "resoto": "search is(aws_ssm_document) and document_shared_with_accounts not in [null, []]"
            },
            "remediation": {
                "text": "Carefully review the contents of the document before is shared. Enable SSM Block public sharing for documents.",
                "url": "https://docs.aws.amazon.com/systems-manager/latest/userguide/ssm-before-you-share.html"
            }
        },
        {
            "name": "resource_non_compliant",
            "title": "Ensuring Compliance Across Multiple AWS Resources with AWS Systems Manager",
            "result_kinds": ["aws_ec2_instance", "aws_dynamodb_table", "aws_ssm_document", "aws_s3_bucket"],
            "categories": ["security", "compliance"],
            "risk": "Non-compliance of diverse AWS resources (EC2 instances, DynamoDB tables, SSM documents, S3 buckets) with AWS Systems Manager policies poses serious risks. It can lead to security vulnerabilities, operational inconsistencies, and breaches of regulatory compliance, ultimately jeopardizing system integrity, data security, and reliability.",
            "severity": "high",
            "detect": {
                "resoto": "is(aws_ssm_resource_compliance) -->"
            },
            "remediation": {
                "text": "To address non-compliance, identify the compliance standards set by AWS Systems Manager and pinpoint the specific requirements not met by each resource. For EC2 instances, ensure the SSM Agent is correctly configured and the instance is adhering to the desired state configurations. For DynamoDB, verify table settings against best practices. Ensure S3 buckets have proper access controls and encryption settings. Regularly update and enforce compliance policies and perform systematic compliance audits. Utilize AWS Systems Manager automation to streamline the remediation process for non-compliant resources.",
                "url": "https://docs.aws.amazon.com/systems-manager/latest/userguide/systems-manager-compliance.html"
            }
        }
    ]
}
